.emacs.d/my-init.org
* Package setup and bootstrap use-package
#+BEGIN_SRC emacs-lisp
(require 'package)
(setq package-archives
      '(("gnu" . "http://elpa.gnu.org/packages/")
        ("melpa" . "http://melpa.org/packages/")
	("melpa-stb" . "https://stable.melpa.org/packages/")))

(package-initialize)

(unless (require 'use-package nil t)
  (if (not (yes-or-no-p (concat "Refresh packages, install use-package and"
                                " other packages used by init file? ")))
      (error "you need to install use-package first")
    (package-refresh-contents)
    (package-install 'use-package)
    (require 'use-package)
    (setq use-package-always-ensure t)))
#+END_SRC

* which-key
#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :ensure t
    :config (which-key-mode
	     (setq which-key-idle-delay .1)))
#+END_SRC

* vterm
#+BEGIN_SRC emacs-lisp
  (use-package vterm
    :custom
    (vterm-shell "/usr/bin/fish")
    (vterm-kill-buffer-on-exit t))

  ;; depends upon projectile and vterm
  (use-package multi-libvterm
    :load-path "multi-libvterm/"
    :bind ("C-`" . multi-libvterm-dedicated-toggle))

#+END_SRC

* small changes
#+BEGIN_SRC emacs-lisp
(tool-bar-mode -1)
(scroll-bar-mode -1)
(global-set-key (kbd "M-o") 'other-window)
(global-display-line-numbers-mode 1)
(auto-save-visited-mode t)
(setq org-src-window-setup 'current-window)
(setq sml/no-confirm-load-theme t)
(org-bullets-mode)
#+END_SRC

* M-x matt-reload
#+BEGIN_SRC emacs-lisp
  (defun matt-reload ()
    (interactive)
    (load-file user-init-file))
#+END_SRC

* M-x learning
#+BEGIN_SRC emacs-lisp
(defun learning ()
  (interactive)
  (find-file "~/.config/helpnotes/emacs.org")
  (split-window-right)
  (find-file "~/masteringemacs.pdf"))
#+END_SRC

* Font
#+BEGIN_SRC emacs-lisp
  (custom-set-faces
   '(default ((t (:family "DejaVuSansMono Nerd Font"
			  :foundry "PfEd"
			  :slant normal
			  :weight normal
			  :height 151
			  :width normal)))))
#+END_SRC
